categories = {"谷物类": ["玉米", "小麦", "早籼稻", "晚籼稻", "粳稻", "粳米", "玉米淀粉"],
        "油脂油料类": ["豆油", "棕榈油", "菜油", "菜籽", "菜籽粕", "豆粕", "豆二"],
        "软商品类": ["白糖", "棉花", "苹果", "红枣", "花生"],
        "其他农产品": ["鸡蛋", "生猪"],
        "贵金属": ["黄金", "白银"],
        "基本金属": ["铜", "铝", "锌", "铅", "镍", "锡"],
        "黑色金属": ["螺纹钢", "线材", "热轧卷板", "不锈钢", "铁矿石", "焦炭", "焦煤"],
        "能源类": ["原油", "天然气", "燃料油", "沥青", "低硫燃料油"],
        "化工类": ["PTA", "聚乙烯", "聚丙烯", "塑料", "PVC", "甲醇", "乙二醇", "苯乙烯", "液化石油气"],
        "橡胶类": ["20号胶", "天然橡胶"],
        "建材类": ["玻璃", "纯碱", "硅铁", "锰硅"],
        "工业品": ["纸浆", "棉纱", "短纤", "纤维板", "胶合板"],
        "股指期货": ["沪深300指数期货", "上证50指数期货", "中证500指数期货", "中证1000指数期货"],
        "国债期货": ["2年期国债期货", "5年期国债期货", "10年期国债期货", "30年期国债期货"],
        "新能源与新材料": ["工业硅", "碳酸锂", "多晶硅"],
        "航运": ["集运指数（欧线）期货"],
        "其他": ["动力煤", "强麦", "郑醇", "烧碱", "二甲苯", "瓶级聚酯切片", "原木", "丁二烯橡胶"]}

breedCode = {'PVC': 'V0', '棕榈油': 'P0', '豆二': 'B0', '豆粕': 'M0', '铁矿石': 'I0', '鸡蛋': 'JD0', '塑料': 'L0', '聚丙烯': 'PP0', '纤维板': 'FB0', '胶合板': 'BB0', '豆油': 'Y0', '玉米': 'C0', '豆一': 'A0', '焦炭': 'J0', '焦煤': 'JM0', '淀粉': 'CS0', '乙二醇': 'EG0', '粳米': 'RR0', '苯乙烯': 'EB0', '液化石油气': 'PG0', '生猪': 'LH0', '原木': 'LG0', 'PTA': 'TA0', '菜油': 'OI0', '菜籽': 'RS0', '菜粕': 'RM0', '强麦': 'WH0', '粳稻': 'JR0', '白糖': 'SR0', '棉花': 'CF0', '早籼稻': 'RI0', '甲醇': 'MA0', '玻璃': 'FG0', '晚籼稻': 'LR0', '硅铁': 'SF0', '锰硅': 'SM0', '棉纱': 'CY0', '苹果': 'AP0', '红枣': 'CJ0', '尿素': 'UR0', '纯碱': 'SA0', '短纤': 'PF0', '花生': 'PK0', '烧碱': 'SH0', '对二甲苯': 'PX0', '瓶片': 'PR0', '燃料油': 'FU0', '上海原油': 'SC0', '铝': 'AL0', '天然橡胶': 'RU0', '锌': 'ZN0', '铜': 'CU0', '黄金': 'AU0', '螺纹钢': 'RB0', '线材': 'WR0', '铅': 'PB0', '白银': 'AG0', '沥青': 'BU0', '热轧卷板': 'HC0', '锡': 'SN0', '镍': 'NI0', '纸浆': 'SP0', '20号胶': 'NR0', '不锈钢': 'SS0', '低硫燃料油': 'LU0', '国际铜': 'BC0', '氧化铝': 'AO0', '丁二烯橡胶': 'BR0', '集运指数欧线期货': 'EC0', '沪深300指数期货': 'IF0', '5年期国债期货': 'TF0', '上证50指数期货': 'IH0', '中证500指数期货': 'IC0', '2年期国债期货': 'TS0', '中证指数期货': 'IM0', '工业硅': 'SI0', '碳酸锂': 'LC0', '多晶硅': 'PS0'}

breedUnits = {'PVC': 5, '棕榈油': 10, '豆二': 10, '豆粕': 10, '铁矿石': 100, '鸡蛋': 5, '塑料': 5, '聚丙烯': 5, '纤维板': 500, '胶合板': 500, '豆油': 10, '玉米': 10, '豆一': 10, '焦炭': 100, '焦煤': 60, '淀粉': 10, '乙二醇': 10, '粳米': 10, '苯乙烯': 5, '液化石油气': 20, '生猪': 16, '原木': 90, 'PTA': 5, '菜油': 10, '菜籽': 10, '菜粕': 10, '强麦': 20, '粳稻': 20, '白糖': 10, '棉花': 5, '早籼稻': 20, '甲醇': 10, '玻璃': 20, '晚籼稻': 20, '硅铁': 5, '锰硅': 5, '棉纱': 5, '苹果': 10, '红枣': 5, '尿素': 20, '纯碱': 20, '短纤': 5, '花生': 5, '烧碱': 30, '对二甲苯': 5, '瓶片': 15, '燃料油': 10, '上海原油': 1000, '铝': 5, '天然橡胶': 10, '锌': 5, '铜': 5, '黄金': 1000, '螺纹钢': 10, '线材': 10, '铅': 5, '白银': 15, '沥青': 10, '热轧卷板': 10, '锡': 1, '镍': 1, '纸浆': 10, '20号胶': 10, '不锈钢': 5, '低硫燃料油': 10, '国际铜': 5, '氧化铝': 20, '丁二烯橡胶': 5, '集运指数欧线期货': 1, '沪深300指数期货': 300, '5年期国债期货': 100, '上证50指数期货': 300, '中证500指数期货': 200, '2年期国债期货': 200, '中证指数期货': 1, '工业硅': 5, '碳酸锂': 1, '多晶硅': 3}

continuousContracts = "V0,P0,B0,M0,I0,JD0,L0,PP0,FB0,BB0,Y0,C0,A0,J0,JM0,CS0,EG0,RR0,EB0,PG0,LH0,LG0,TA0,OI0,RS0,RM0,ZC0,WH0,JR0,SR0,CF0,MA0,FG0,SF0,SM0,CY0,AP0,CJ0,UR0,SA0,PF0,PK0,SH0,PX0,PR0,FU0,SC0,AL0,RU0,ZN0,CU0,AU0,RB0,WR0,PB0,AG0,BU0,HC0,SN0,NI0,SP0,NR0,SS0,LU0,BC0,AO0,BR0,EC0,SI0,LC0,PS0"

listOfSymbols = ['镍', '黄金', '热轧卷板', '铝', '螺纹钢', '不锈钢', '沥青', '沪锌', '铜', '纸浆', '20号胶', '铅', '丁二烯橡胶', '氧化铝', '天然橡胶', '白银', '锡', '低硫燃料油', '燃料油', '集运指数欧线期货', '号胶']