
# VARIETY = ['沪铜', '沪铝', '沪锌', '沪铅', '沪镍', '沪锡', '螺纹钢', '白银', '橡胶', '沥青', '纸浆',
#            '豆粕', '豆油', '棕榈', '玉米', '鸡蛋', '塑料', 'PVC', 'PP', '苯乙烯', 'PTA',
#            '乙二醇', '铁矿石', '焦煤', '焦炭', '生猪', '工业硅', '碳酸锂', '鲜苹果',  '红枣',
#            '棉花', '白糖', '菜油', '菜粕', '玻璃', '纯碱', '郑醇', '尿素', '锰硅',
#            '硅铁', '短纤', '二甲苯']
VARIETY = ['螺纹钢']
# N_SHIJIE = {
#     "用户名": "113496",
#     "密码": "ws1008351115",
#     "经纪商代码": "9999",
#     "交易服务器": "tcp://180.168.146.187:10130",
#     "行情服务器": "tcp://180.168.146.187:10131",
#     "产品名称": "simnow_client_test",
#     "授权编码": "0000000000000000"}

N_SHIJIE = {
    "用户名": "00687310",
    "密码": "63296729",
    "经纪商代码": "10010",
    "交易服务器": "tcp://210.14.72.12:4600",
    "行情服务器": "tcp://210.14.72.12:4602",
    "产品名称": "",
    "授权编码": ""}


VARIETY_EN = ['CU2502', 'AL2503', 'ZN2502', 'PB2502', 'NI2502', 'SN2502', 'RB2505', 'AG2504', 'RU2509', 'BU2503', 'SP2505', 'M2509', 'Y2505', 'P2505', 'C2505', 'JD2503', 'L2505', 'V2505', 'PP2505', 'EB2502', 'TA2505', 'EG2505', 'I2505', 'JM2505', 'J2505', 'LH2505', 'SI2505', 'LC2505', 'AP2505', 'CJ2505', 'CF2505', 'SR2505', 'OI2505', 'RM2505', 'FG2505', 'SA2505', 'MA2505', 'UR2505', 'SM2505', 'SF2503', 'PF2503', 'PX2505']